package z.other;

public class Operation00_Index {
	public static void main(String[] args) {

		/*
		 * 연산자
		 * 
		 * 01. 산술연산자
		 * 			+, -, *, /, %
		 * 
		 * 02. 복합대입연산자
		 * 			+=, -=, *=, /=, %=
		 * 
		 * 03. 비교연산자
		 * 			<, <=, >, >=, ==, !=
		 * 
		 * 04. 논리연산자 + SCE & 문제점
		 * 			&&, ||, !, ^
		 * 
		 * 05. 전위 후위 증감연산자
		 * 			++expr, --expr, expr++, expr--
		 * 
		 * 06. 비트 연산자, 비트시프트 연산자
		 *			&, |, ~, ^, <<, >>
		 * 
		 * 07. 삼항연산자
		 * 			조건식 ? 조건 true 실행문 : 조건 false 실행문 ;
		 * 
		 * 99. 음의 정수의 2진법 표현 : 2의 보수
		 * 			~expr + 1
		 */

		/* 연산자 우선순위 */

	}
}